---
kind: type
id: T:Autodesk.Revit.DB.Structure.TrussMemberInfo
source: html/4d22fb31-c93c-7d65-31c3-49175eb3469d.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberInfo

Provides access to the information of a truss member in Autodesk Revit.

## Syntax (C#)
```csharp
public class TrussMemberInfo
```

## Remarks
A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.